Revit 2026 API
ValueAtPoint Class
 Stores values at one domain point. Each value corresponds to a "measurement" for which this value was calculated.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ValueAtPointBase
 Autodesk.Revit.DB.Analysis.ValueAtPoint
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class ValueAtPoint : ValueAtPointBase
Public Class ValueAtPoint
	Inherits ValueAtPointBase
public ref class ValueAtPoint : public ValueAtPointBase
type ValueAtPoint =
    class
        inherit ValueAtPointBase
    end
The ValueAtPoint type exposes the following members.
Constructors
Name | Description
ValueAtPoint(IList<Double>) | Initializes a new instance of the ValueAtPoint class
ValueAtPoint(ValueAtPoint) |  Creates a copy of the given ValueAtPoint instance.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from ValueAtPointBase)
Top
Methods
Name | Description
ClearAllFlags |  Sets flags for all measurements to ValueAtPointFlags::None.
(Inherited from ValueAtPointBase)
ClearFlagsAt |  Sets flags for the given measurement to ValueAtPointFlags::None.
(Inherited from ValueAtPointBase)
Dispose
(Inherited from ValueAtPointBase)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetFlags |  Returns flags for the given measurement.
(Inherited from ValueAtPointBase)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetFlags(IList<Int32>)
(Inherited from ValueAtPointBase)
SetFlags(Int32) |  Sets the flags associated to all measurements to the same value.
(Inherited from ValueAtPointBase)
SetFlags(Int32, Int32) |  Sets the flags associated to a given measurement.
(Inherited from ValueAtPointBase)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace